W7/W7D5/reddit_clone_2/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "A4__PjjMYHy8P0cmaD7aJA"], ["updated_at", "2022-06-03 18:28:47.459480"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save