W7/W7D5/reddit_clone_2/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "The Deadly Tiger"], ["url", ""], ["content", ""], ["sub_id", 1], ["user_id", 1], ["created_at", "2022-06-03 21:37:11.384774"], ["updated_at", "2022-06-03 21:37:11.384774"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save