W7/W7D5/reddit_clone_2/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id

        if @sub.save!
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Animals"], ["description", "All things animals!"], ["user_id", 1], ["created_at", "2022-06-03 20:46:17.017773"], ["updated_at", "2022-06-03 20:46:17.017773"]]

    def update
        @sub = Sub.find_by(id: params[:id])
        # debugger
        if @sub.update(sub_params)
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "All things fluffy animals!"], ["updated_at", "2022-06-03 21:06:14.296292"], ["id", 1]]