W6/W6D5/cats_99_v2/app/controllers/cats_controller.rb

    def update
        cat = Cat.find_by(id: params[:id])

        if cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["description", ""], ["updated_at", "2022-05-30 05:28:26.549153"], ["id", 2]]