W7/W7D3/music_app/app/controllers/albums_controller.rb

    def new #_form partials
        @album = Album.new
        @band = Band.find(params[:band_id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]