W7/W7D3/music_app/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "T1AMjzFLA23x2VF8TXM_Pg"], ["LIMIT", 1]]
---
    def current_user #returns the current user
        return nil if session[:session_token].nil?
        @current_user ||= User.find_by(session_token: session[:session_token])