W7/W7D3/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Black Keys"], ["created_at", "2022-06-01 22:30:52.073774"], ["updated_at", "2022-06-01 22:30:52.073774"]]
---
    def create
        @band = Band.new(band_params)

        if @band.save!

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def edit #_form partials
        @band = Band.find(params[:id])