W7/W7D3/music_app/app/models/user.rb

    def self.find_by_credentials(email, password)
        #Only returns a user if email and password are correct
        user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "superman@kryptonite.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "XPg_qeUPPhQTMyhMapUiPA"], ["updated_at", "2022-06-01 21:17:47.417382"], ["id", 1]]